In [2]:
# creating a Dataframe
import pandas as pd
l=[1,2,3,2,3,2,3,3,3,4,3,22]
pd.Series(l)

0      1
1      2
2      3
3      2
4      3
5      2
6      3
7      3
8      3
9      4
10     3
11    22
dtype: int64

In [4]:
# creating a customized dictionary 
l={'one':1,'two':567,'three':783,'four':89,'five':898,'six':89}
l

{'one': 1, 'two': 567, 'three': 783, 'four': 89, 'five': 898, 'six': 89}

In [6]:
pd.Series(l)

one        1
two      567
three    783
four      89
five     898
six       89
dtype: int64

In [36]:
# creating a Dataframe
data=[[1000,'jobs',89.90],[1001,'khan',89.87],[1002,'jack',80.12]]
data1=pd.DataFrame(data)
data1

      0     1      2
0  1000  jobs  89.90
1  1001  khan  89.87
2  1002  jack  80.12

In [39]:
data2=pd.DataFrame(data,columns=['RegID','Name','Percentage'],index=[1,2,3])
data2

   RegID  Name  Percentage
1   1000  jobs       89.90
2   1001  khan       89.87
3   1002  jack       80.12

In [9]:
pwd

'C:\\Users\\ABHINAV SINGH'

In [10]:
exam_scores = pd.read_csv("exam_scores.csv")

In [11]:
exam_scores.shape

(1000, 8)

In [12]:
exam_scores.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66
2,male,group C,some college,free/reduced,none,66,65,65
3,female,group D,bachelor's degree,free/reduced,none,74,75,73
4,male,group D,some college,standard,none,78,77,71

In [13]:
exam_scores.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group C,some high school,standard,none,68,77,72
996,female,group E,some college,standard,none,98,81,94
997,female,group E,associate's degree,free/reduced,none,67,67,67
998,female,group C,high school,standard,none,63,68,70
999,male,group C,some college,free/reduced,none,49,57,50

In [14]:
exam_scores.head(2) # customizing the number of touples we want

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66

In [15]:
exam_scores.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [16]:
exam_scores.info()
# gives the info about where the libraries exists and how it could be implemented

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [18]:
# iloc is used for selecting data based on numerical position
# data_frame.iloc[,]  for multidimensional array 
#  selecting first row and first column 
exam_scores.iloc[0,0]

'male'

In [20]:
# selcting like we did in the form of slicing 
exam_scores.iloc[0:9,0]

0      male
1    female
2      male
3    female
4      male
5    female
6    female
7      male
8      male
Name: gender, dtype: object

In [24]:
#selecting all the items 
# exam_scores.iloc[:,:]
# passing the particular indeces
exam_scores.iloc[[1,2,490,43,450],5:7]

     math score  reading score
1            58             68
2            66             65
490          54             75
43           57             55
450          65             79

In [25]:
# loc and iloc are conceptually similar.
# The difference is that iloc considers the default indexing while loc ignores the default indexing
# to get the 3rd entry in the race/ethencity
exam_scores.loc[3,'race/ethnicity']

'group D'

In [26]:
exam_scores.loc[0:5,['race/ethnicity','lunch','math score']]

  race/ethnicity         lunch  math score
0        group B      standard          74
1        group C      standard          58
2        group C  free/reduced          66
3        group D  free/reduced          74
4        group D      standard          78
5        group D      standard          75

In [40]:
data2

   RegID  Name  Percentage
1   1000  jobs       89.90
2   1001  khan       89.87
3   1002  jack       80.12

In [41]:
data2.Name

1    jobs
2    khan
3    jack
Name: Name, dtype: object

In [42]:
data2['Name']

1    jobs
2    khan
3    jack
Name: Name, dtype: object

In [43]:
data2[['Name','Percentage']]

   Name  Percentage
1  jobs       89.90
2  khan       89.87
3  jack       80.12

In [47]:
data2[data2.Name=='jobs']

   RegID  Name  Percentage
1   1000  jobs        89.9

In [48]:
data2.Name=='jobs'

1     True
2    False
3    False
Name: Name, dtype: bool

In [52]:
# assigning at one go !!!!!!
data2.Name = 'abcx'
data2

   RegID  Name  Percentage
1   1000  abcx       89.90
2   1001  abcx       89.87
3   1002  abcx       80.12

In [53]:
# info as the summary and describe() as to 
# exam_scores already loaded the exam_scores.csv file 
exam_scores.describe()

        math score  reading score  writing score
count  1000.000000     1000.00000    1000.000000
mean     67.128000       70.17400      68.973000
std      14.815367       14.85599      15.109155
min      15.000000       18.00000      10.000000
25%      58.000000       60.00000      59.000000
50%      67.000000       70.00000      69.000000
75%      78.000000       81.00000      80.000000
max     100.000000      100.00000     100.000000

In [54]:
exam_scores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [55]:
# If we want to get summary about categorical column separately then we can use one parameter 
# 'include'. 
exam_scores.describe(include='object')

,gender,race/ethnicity,parental level of education,lunch,test preparation course
count,1000,1000,1000,1000,1000
unique,2,5,6,2,2
top,female,group C,some college,standard,none
freq,502,294,226,649,654

In [57]:
exam_scores.describe(include='all')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
count,1000,1000,1000,1000,1000,1000.000000,1000.00000,1000.000000
unique,2,5,6,2,2,NaN,NaN,NaN
top,female,group C,some college,standard,none,NaN,NaN,NaN
freq,502,294,226,649,654,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,67.128000,70.17400,68.973000
std,NaN,NaN,NaN,NaN,NaN,14.815367,14.85599,15.109155
min,NaN,NaN,NaN,NaN,NaN,15.000000,18.00000,10.000000
25%,NaN,NaN,NaN,NaN,NaN,58.000000,60.00000,59.000000
50%,NaN,NaN,NaN,NaN,NaN,67.000000,70.00000,69.000000
75%,NaN,NaN,NaN,NaN,NaN,78.000000,81.00000,80.000000
max,NaN,NaN,NaN,NaN,NaN,100.000000,100.00000,100.000000

In [59]:
exam_scores['math score'].describe()
# the math score is [] due to the space

count    1000.000000
mean       67.128000
std        14.815367
min        15.000000
25%        58.000000
50%        67.000000
75%        78.000000
max       100.000000
Name: math score, dtype: float64

In [61]:
# whe we want a particular aggregate function 
exam_scores.mean()
# shows only where the numerical value exists

C:\Users\ABHINA~1\AppData\Local\Temp/ipykernel_1216/3753280617.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  exam_scores.mean()

math score       67.128
reading score    70.174
writing score    68.973
dtype: float64

In [62]:
exam_scores.gender.value_counts()

female    502
male      498
Name: gender, dtype: int64

In [64]:
exam_scores['math score'].value_counts()

63    35
61    32
62    32
76    30
60    29
      ..
28     1
35     1
18     1
23     1
15     1
Name: math score, Length: 74, dtype: int64

In [65]:
# SORTING 
exam_scores.sort_values(by='math score').head(3)
# head by def take 5 values 
# by def sorting is in the ascendign order

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
949,male,group C,high school,free/reduced,none,15,18,10
854,male,group C,high school,free/reduced,none,18,30,18
891,female,group C,high school,free/reduced,none,23,31,27

In [66]:
exam_scores.sort_values(by='math score',ascending=False).head(3)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
91,male,group D,associate's degree,standard,none,100,94,96
776,male,group E,associate's degree,standard,completed,100,100,100
588,male,group D,some college,standard,completed,100,85,91

In [67]:
# Another Way of sorting 
exam_scores['writing score'].sort_values(ascending=False)[:7]

767    100
140    100
520    100
636    100
788    100
271    100
895    100
Name: writing score, dtype: int64

In [69]:
# ReNaming fuction 
exam_scores.rename(columns={
    'race/ethnicity':'race',
    'parental level of education':'parent_education_level',
    'test preparation course':'test_prep_course',
    'math score':'math_score',
    'reading score':'reading_score',
    'writing score':'writing_score'
},inplace=True)

In [70]:
exam_scores.columns

Index(['gender', 'race', 'parent_education_level', 'lunch', 'test_prep_course',
       'math_score', 'reading_score', 'writing_score'],
      dtype='object')

In [71]:
exam_scores.head(3)

,gender,race,parent_education_level,lunch,test_prep_course,math_score,reading_score,writing_score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66
2,male,group C,some college,free/reduced,none,66,65,65

In [72]:
# MisSing Values
# isnnull() and isna()
data2.isna()

   RegID   Name  Percentage
1  False  False       False
2  False  False       False
3  False  False       False

In [73]:
# summing up the null columns 
exam_scores.isnull().sum()

gender                    0
race                      0
parent_education_level    0
lunch                     0
test_prep_course          0
math_score                0
reading_score             0
writing_score             0
dtype: int64

In [74]:
# fillinf the null column with some attr
# fillna()
data3=[['av',12,89.90],['ab',12,89.2],['jm']]
data3

[['av', 12, 89.9], ['ab', 12, 89.2], ['jm']]

In [75]:
data4=pd.DataFrame(data3)
data4

    0     1     2
0  av  12.0  89.9
1  ab  12.0  89.2
2  jm   NaN   NaN

In [86]:
data6=pd.DataFrame(data3,columns=['Name','clas','Percentage'],index=[1,2,3])
data6

  Name  clas  Percentage
1   av  12.0        89.9
2   ab  12.0        89.2
3   jm   NaN         NaN

In [102]:
data6.clas.fillna('unknown')

1       12.0
2       12.0
3    unknown
Name: clas, dtype: object

  Name     clas  Percentage
1   av     12.0        89.9
2   ab     12.0        89.2
3   jm  unknown         NaN

In [104]:
data6

  Name     clas  Percentage
1   av     12.0        89.9
2   ab     12.0        89.2
3   jm  unknown         NaN

In [105]:
# chnaging in the original DF
data6.clas.fillna('unknown', inplace=True)
data6

  Name     clas  Percentage
1   av     12.0        89.9
2   ab     12.0        89.2
3   jm  unknown         NaN

In [107]:
data6['Percentage'].mean()

89.55000000000001

In [108]:
data6['Percentage'].fillna(data6['Percentage'].mean(),inplace=True)

In [109]:
data6

  Name     clas  Percentage
1   av     12.0       89.90
2   ab     12.0       89.20
3   jm  unknown       89.55